{"name":"Next Door, Around the Corner, Inside the Bathhouse, By the Sea, and Back","title":"Next Door, Around the Corner, Inside the Bathhouse, By the Sea, and Back","description":"This series combines the tradition of filet lace and gay pornography to examine queer transmigrant experience via the lens of the American dream.","path":"/series/next-door-around-the-corner-inside-the-bathhouse-by-the-sea-and-back","template":"series","textColor":"#000000","linkColor":"#9d3f3f","linkHoverColor":"#6bbf5a","topColor":"#578eff","bottomColor":"#7beabf","textOne":"This new body of work is tracing the lineage of the filet lace via Spain during the Spanish occupation (1565 – 1898) and how it developed in the Philippines and then altered for the American palette amid the transition of power from being an occupied country during the Philippine-American War (1899 – 1902) and then as an unincorporated territory of the United States and, later, a U.S. Commonwealth (until 1946). This historically layered and complicated technique acts as a visual framework to analyze identity, especially the inferiority complex imposed by colonialism. Specifically, how that has shaped the diaspora and how that trickles down generationally. This is further complicated by obliquely looking at the optics of a racially ambiguous Asian American gay male pornstar, Brandon Lee, from the late 90s – 2000s who happens to be Filipino. Still, his ethnicity was never highlighted during his rise to fame. The reason for this visual strategy is to see how identity is formed through the fractures of an occupied country. Notably how European and American imperialisms have reshaped how people of the Philippines view themselves and how that can be mended by queer strategies of flourishing outside these confines. Much like the evolution of filet lace as a material witness through two imperialist forces, Brandon Lee traversed the screen to question the desires and power dynamics of a brown body with an American boy next door persona in a sea of white bodies.\r\n\r\nThe rise of Brandon Lee was also on the cusp of the Internet in the 1990s when his imagery was extended through people’s private screens, into a grid of pixels. Using the filet lace as a screen as well, the resolution of the images is shifted in scale and tactile materiality of the technique, which brings it in and out of focus. ","textTwo":"","textThree":"","carouselOne":[{"image":"CarouselRB.jpg","subtext":"**Roger Brown Residency**, New Buffalo, MI, 2022"},{"image":"CarouselRB2.jpg","subtext":"**Roger Brown Residency**, New Buffalo, MI, 2022"},{"image":"CarouselRB3.jpg","subtext":"**Roger Brown Residency**, New Buffalo, MI, 2022"}],"gridOne":"","gridThree":[{"image":"DSC_0464.jpg","subtext":"**Sun-Kissed and Waiting**, 2022\r\nReactive dye, mercerized combed cotton broadcloth, sublimation dye, mercerized cotton yarn, fiberfill, binder’s board, aluminum wire, and bamboo\r\n60″ x 40″ x 36″"},{"image":"DSC_0396-2.jpg","subtext":"**Superstar**, 2022\r\nReactive dye, mercerized combed cotton broadcloth, sublimation dye, mercerized cotton yarn, fiberfill, binder’s board, aluminum wire, and bamboo  \r\n59″ x 35″ x 35″"},{"image":"DSC_0375.jpg","subtext":"**Lost in Armpit Musk**, 2022\r\nReactive dye, mercerized combed cotton broadcloth, sublimation dye, mercerized cotton yarn, fiberfill, binder’s board, aluminum wire, and bamboo  \r\n51” x 45” x 11”"},{"image":"DSC_0215.jpg","subtext":"**Squeak from a Vinyl Seat**, 2022\r\nReactive dye, mercerized combed cotton broadcloth, mercerized cotton yarn, fiberfill, sublimation dye, and bamboo\r\n71” x 35” x 5.5”"},{"image":"DSC_0232.jpg","subtext":"**Slip and Fall into You**, 2022\r\nReactive dye, mercerized combed cotton broadcloth, mercerized cotton yarn, fiberfill, sublimation dye, and bamboo\r\n82” x 40” x 19.5”"},{"image":"DSC_0168.jpg","subtext":"**Soft Nape Hair**, 2022\r\nReactive dye, mercerized combed cotton broadcloth, mercerized cotton yarn, fiberfill, mohair, sublimation dye, and bamboo\r\n45” x 45” x 21”"}],"modalColor":"#3e68bb"}
