{"name":"Open House Spatter","title":"Open House Spatter","description":"","path":"/series/open-house-spatter","template":"series","textColor":"#000000","linkColor":"#000000","linkHoverColor":"#dd8888","topColor":"#ee7d20","bottomColor":"#bb449b","carouselOne":[{"title":"Western Exhibitions, Chicago, IL, 2022. Photo credit: Western Exhibitions","image":"Install-view_Jade-Yumang_at_Western-Exhibitions_1.jpg"},{"title":"Western Exhibitions, Chicago, IL, 2022. Photo credit: Western Exhibitions","image":"Install-view_Jade-Yumang_at_Western-Exhibitions_2.jpg"},{"title":"Western Exhibitions, Chicago, IL, 2022. Photo credit: Western Exhibitions","image":"Install-view_Jade-Yumang_at_Western-Exhibitions_8.jpg"},{"title":"Western Exhibitions, Chicago, IL, 2022. Photo credit: Western Exhibitions","image":"Install-view_Jade-Yumang_at_Western-Exhibitions_14.jpg"},{"title":"Western Exhibitions, Chicago, IL, 2022. Photo credit: Western Exhibitions","image":"Install-view_Jade-Yumang_at_Western-Exhibitions_3.jpg"}],"textOne":"This work is based on two articles published independently from each other in 1964. One was on February 22nd in Maclean’s, titled “The Homosexual Next Door: A Sober Appraisal of a New Social Phenomenon” by Sidney Katz; and the other on June 26th in Life, titled “Homosexuality in America” by Paul Welch. The former painting a sympathetic light and the other having a residual undertone from the McCarthy era comparing homosexuals to Communists and labeling them a problem.\r\n\r\nThis project is an investigation on a gendered site of suburban living especially during the post-World War II era in North America. With the expansion of suburbs came along the identity of a nuclear family that both maps out and expels queer ethos into city dwellings (“gay ghettos”) or rural areas (“lesbian lands”). In the Maclean’s article, Katz states that “[s]ome are “married” couples living quietly but well in suburban bungalows.” While in Life, Welch derides queer practices “as a sad and often sordid world” and the only respectable ones are “married” and have a place in the suburbs. Both articles, although the Canadian one more sensitive and less callous than the American, frame a similar view that homosexuality can only be tolerated if it parallels itself to a traditional heteronormative practice of marriage.\r\n\r\nThe date of the articles is also particularly interesting as they herald the visibility of queers within the civil rights movement: the introduction of the Omnibus Bill in 1967 by Justice Minister Pierre Trudeau decriminalizing “homosexual acts” between consenting adults over twenty-one; and the 1969 Stonewall Uprisings in New York City. These publications also become a pivotal point in charting how queerness is historicized and contested in Canada and the United States. And hints on a queer domesticity as it constructs a space that is complex; in one way the articles demystify queerness and challenge rigidly gendered suburban life, on the other hand it perpetuates the idea of sameness rather than celebrating differences conceived within the confines of an idealized and fixed home.\r\n\r\nPrevalent during this push for domestic bliss were home décor advertisements. One of which were asbestos vinyl floor tile designs called “gay spatter” with whimsical colour combinations, which the patterns on the sculptures are based on. As well, occult, erotic, horror films rife with queer anxiety were gaining ground to reflect the abandoning of the Hays Code and a foreseeable change of the dynamics of queer kinship, haunted by the fear of the toxic nuclear family. Here random body parts reach, creep, crawl, slither, and taunt the foundation of the home.\r\n\r\nThis project is made possible by the support of Canada Council for the Arts (Research and Creation Grant).\r\n","gridOne":[{"subtext":"Concord Yellow No. 742, 2019\r\nArchival ink on cotton, polypropylene, silk film, fiberfill, batting, wool, dye, acrylic, wallpaper, beads, basswood, pine, and hardware\r\n36” x 36” x 24”","image":"ConcordYellowNo742.jpg"},{"subtext":"Norwich Turquoise No. 743, 2019\r\nArchival ink on cotton, wallpaper, beads, cotton, batting, fiberfill, dye, acrylic, basswood, pine, and hardware\r\n36” x 18” x 28”","image":"NorwichTurquoiseNo743Detail1.jpg"},{"subtext":"Lexington Green No. 738, 2019\r\nArchival ink on cotton, wallpaper, beads, cotton, batting, fiberfill, wool, polyester, zipper, dye, acrylic, basswood, pine, and hardware\r\n36” x 24” x 18”","image":"Lexington-GreenNo738.jpg"},{"subtext":"Exeter Red No. 741, 2019\r\nArchival ink on cotton, wallpaper, beads, cotton, batting, fiberfill, wool, zipper, dye, acrylic, basswood, pine, and hardware\r\n46.25” x 27” x 24.125”","image":"ExeterRedNo741.jpg"},{"subtext":"","image":""}],"textTwo":"","textThree":""}