{"name":"prolonged physical contact","title":"Prolonged Physical Contact","description":"A series exploring an obscenity case through the use of needle turn appliqué.","path":"/series/prolonged-physical-contact","template":"series","page":"series/prolonged-physical-contact","textColor":"#fafdff","linkColor":"#006eb3","linkHoverColor":"#ffd500","topColor":"#b061e5","bottomColor":"#d38022","modalColor":"#036846","textOne":"","textTwo":"This new ongoing series is based on the 1999 prosecution of Terry Tippit, a gay bar owner of Run Bar in Omaha, Nebraska. He was accused of obscenity based on displaying “offensive” photographs in the bar’s basement. Inspectors found these photographs and complained to the police during a routine fire inspection. An investigation followed, which scrutinized twenty-two images and determined that three works violated obscenity laws for the state of Nebraska. Tippit’s defense argued that these photographs have artistic value and are “part of large gay art collection.” Unfortunately, an art historian for the prosecution analyzed the images as having no “serious” artistic value. These images are difficult to find and only exist and persist through the detailed descriptions of three out of twenty-two images by the state. Unintentionally, the descriptions of the three in question are wonderfully salacious and droll, which only highlights the world the state was trying to invalidate. The mystery of the remaining nineteen gives me the leverage to frolic and imagine what these worlds are in intimate appliqué tableaus.","textThree":"","gridThree":[{"image":"Exhibit9JadeYumang3.jpg","subtext":"**Exhibit 9**, 2023\r\nDye on cotton, interfacing, oak, basswood, and pine\r\n12″ x 16″ x 3.5″"},{"image":"Exhibit8JadeYumang.jpg","subtext":"**Exhibit 8**, 2023\r\nDye on cotton, interfacing, aluminum, fiberfill, basswood, and pine\r\n17″ x 16″ x 1″"},{"image":"Exhibit7JadeYumang4.jpg","subtext":"**Exhibit 7**, 2023\r\nDye on cotton, interfacing, binder’s board, basswood, and pine\r\n12″ x 16.5″ x 3″"},{"image":"Exhibit6JadeYumang.jpg","subtext":"**Exhibit 6**, 2023\r\nDye on cotton, interfacing, cotton piping cord, basswood, and pine\r\n12″ x 17.25″ x 3.5″"},{"image":"Exhibit5JadeYumang3.jpg","subtext":"**Exhibit 5**, 2023\r\nDye on cotton, interfacing, binder’s board, basswood, and pine\r\n12.25″ x 16.5″ x 5″"},{"image":"Exhibit4JadeYumang.jpg","subtext":"**Exhibit 4**, 2023\r\nDye on cotton, interfacing, fiberfill, cotton piping cord, basswood, and pine\r\n13.5″ x 19″ x 2″"}]}
