{"path":"/about","template":"about","title":"About","description":"Jade Yumang examines how queer optics permeate into culture, how that is absorbed, embodied, repeated, and eventually materialized into deviating form","textColor":"#000000","hoverColor":"#000000","topColor":"#ffffff","bottomColor":"#d6edf0","paragraphs":["Born in Quezon City, Philippines and named after Jade’s mother’s beauty salon, Jade then grew up in Dubai, United Arab Emirates, and immigrated to Vancouver, BC, Canada, which is the traditional, ancestral, and unceded Indigenous territories of the xʷməθkʷəy̓əm (Musqueam), Sḵwx̱wú7mesh Úxwumixw (Squamish), səl̓ilw̓ətaʔɬ (Tsleil-Waututh), QayQayt First Nation, Kwantlen, q̓íc̓əy̓ (Katzie), Semiahmoo, Tsawwassen First Nations, kʷikʷəƛ̓əm (Kwikwetlem), and Stó:lō Nation. Jade currently lives in Chicago, IL, USA, which sits on the traditional homelands of the people of the Council of Three Fires, the Ojibwe, Potawatomi, and Odawa as well as the Menominee, Miami and Ho-Chunk nations.","Jade is an Assistant Professor in the Department of Fiber and Material Studies at the School of the Art Institute of Chicago.","Jade Yumang examines how queer optics permeate into culture, how that is absorbed, embodied, repeated, and eventually materialized into deviating forms through a variety of techniques to convey notions of phenomenology, affect, and “queer” as a process. This strategy is usually executed through three-dimensional, site-specific installation, and performative work as a way to see how the body resists or submits through materiality and technique vis-à-vis obsessive acts, strict parameters, and discipline. Jade looks at flickers of resistance by outlining historical amnesia, myths, scandal trials, obscenity laws, love, kinship, joy, filmic tropes, and pornography. Jade kindles these moments through meticulous techniques and create abstract shapes that initially originate from a corporeal source. Typically, these ideas are tackled through a large series to tease out its formal qualities with the context that repetition creates differences and asserts a constant change. Jade primarily uses fiber techniques because of its reliance on tension and/or force in order to create materials that are strong, resilient, yet soft and pliable.","jade@jadeyumang.com\r\n@jadeyumang"],"columnOne":["# Selected Solos\r\n## 2024\r\n*Title TBD*, School of Art Gallery, University of Manitoba, Winnipeg, MB. [Forthcoming]\r\n\r\n## 2023\r\n*Title TBD,* Ignition Project Space, Chicago, IL. [Forthcoming]\r\n\r\n## 2022\r\n*Title TBD,* Western Exhibitions, Chicago, IL. [Forthcoming]\r\n\r\n*Open House Spatter*, CIRCA Art Actuel, Montréal, QC.\r\n\r\n## 2021\r\n*Open House Spatter*, Art-in-Buildings, 125 Maiden Lane, Time Equities Inc., New York, NY.\r\n<small>curated by Tessa Ferreyros and Eliana Blechman</small>\r\n\r\n## 2019\r\n*Drum*, Craft Council Main Gallery, St. John's, NL.\r\n\r\n*In the Shadows*, Art League Houston Main Gallery, Houston, TX.\r\n\r\n## 2017\r\n*Thumb Through*, TRUCK Contemporary Art, Calgary, AB.\r\n\r\n*My-O-My*, CP Projects Space at School of Visual Arts, New York, NY.\r\n<small>curated by Jasa McKenzie</small>\r\n\r\n## 2015\r\n*Citations*, Eastern Edge Gallery, St. John’s, NL.\r\n\r\n*Citations*, Box13 Artspace, Houston, TX.\r\n\r\n## 2014\r\n*Post Performance Syndrome*, Wooster Street Window Gallery [Installation] and Crimson Field, Prince Street Project Space [Installation and Performance], The Leslie-Lohman Museum of Art, New York, NY.\r\n\r\n## 2011\r\n*Openwork*, CAA MFA, Hunter College/Times Square Gallery, New York, NY.\r\n\r\n## 2009\r\n*Hard Candy*, Malaspina Printmakers Gallery, Vancouver, BC.\r\n\r\n## 2008\r\n*The Birds & the Boys*, Plank Gallery, Vancouver, BC.","# Selected Two-Person, Group Exhibitions, and Performances [P]\r\n## 2022\r\n*The Sum of the Parts: Dimensions in Quilting*, Craft Contemporary, Los Angeles, CA.\r\n<small>curated by Holly Jerger</small>\r\n\r\n*Not me, Not that, Not nothing Either*, The Leslie-Lohman Museum of Art, New York, NY.\r\n<small>curated by Nirvana Santos-Kuilan and Rachel Beaudoin</small>"],"columnTwo":["# Teaching\r\n## 2018 - Present\r\n[Assistant Professor](http://www.saic.edu/profiles/faculty/jade-yumang)\r\nDepartment of Fiber and Material Studies\r\nSchool of the Art Institute of Chicago\r\n\r\n## 2018\r\nSessional Lecturer\r\nPrint Media Department\r\nEmily Carr University + Design, Vancouver, BC.\r\n\r\n## 2014 - 2018\r\nSessional Lecturer\r\nDepartment of Art History, Visual Arts & Theory\r\nUniversity of British Columbia, Vancouver, BC.","# Education\r\n## 2012\r\nMFA with Departmental Honors (Fine Arts)\r\nParsons School of Design, New York, NY.\r\n<small>thesis advisors: Mira Schor and Coco Fusco</small>\r\n\r\n## 2008\r\nBFA Honors (Visual Arts)\r\nUniversity of British Columbia, Vancouver, BC.\r\ntop of the graduating class"]}