{"CarouselRB.jpg":{"alt":"Installation shot taken in the Roger Brown Residency studio of two wall soft sculptures with filet lace and netting elements framed in bamboo that are tied using square lashing knots.","origHeight":800,"origWidth":1400,"extractWidth":null,"extractHeight":null,"extractLeft":0,"extractTop":0,"resizeWidth":null,"resizeHeight":null,"rotate":null,"sharpen":null,"modified":false,"height":800,"width":1400},"CarouselRB2.jpg":{"alt":"Close up shot of an embroidered element of a filet lace used as a sculptural element with a sublimated image embedded into the fiber. ","origHeight":800,"origWidth":1400,"extractWidth":null,"extractHeight":null,"extractLeft":0,"extractTop":0,"resizeWidth":null,"resizeHeight":null,"rotate":null,"sharpen":null,"modified":false,"height":800,"width":1400},"CarouselRB3.jpg":{"alt":"Installation shot taken in the Roger Brown Residency studio of two wall soft sculptures with filet lace and netting elements framed in bamboo that are tied using square lashing knots.","origHeight":800,"origWidth":1400,"extractWidth":null,"extractHeight":null,"extractLeft":0,"extractTop":0,"resizeWidth":null,"resizeHeight":null,"rotate":null,"sharpen":null,"modified":false,"height":800,"width":1400},"LickIntoShapeJadeYumang.jpg":{"alt":"Wall sculpture in pink and purple. The top part is a soft sculpture shaped into several long pink tongues jumbled together. The bottom part is a rectangular filet lace with a detailed embroidered image in the middle that has been dye sublimated and then embellished with dimensional pointed stitches.","origHeight":3203,"height":3203,"origWidth":2136,"width":2136,"modified":false},"MakahiyaBoiJadeYumang.jpg":{"alt":"A free standing soft sculpture tie dyed in hues of forest green, primrose yellow, and deep purple with filet lace and netting elements framed in bamboo that are tied using square lashing knots. Within the filet lace is an embedded gay pornographic image using a sublimation dye technique. The soft sculpture element has a main body suspended in the middle of the bamboo frame with holes where a rope-like pieces are tied in a snake knot with talons attached at the end..","origHeight":4608,"height":4608,"origWidth":3072,"width":3072,"modified":false},"MoreThanOneCopy.jpg":{"alt":"A wall art sculpture with filet lace components framed with soft sculpture cording. At the bottom right is a soft sculpture of a heart lock and on the left is a key. The color of the sculpture is a mix of black, blue, yellow, and red. Within the filet lace is an embedded gay pornographic image using a sublimation dye technique.","origHeight":4342,"height":4342,"origWidth":2895,"width":2895,"modified":false},"ObedienceTraining.jpg":{"alt":"A free standing soft sculpture reverse tie dyed in hues of black and beige with filet lace and netting elements framed in bamboo. Within the filet lace is an embedded gay pornographic image using a sublimation dye technique. The soft sculpture element has a main body suspended in the middle of the bamboo frame with holes where a vine-like pieces are twisted around.","origHeight":4376,"height":4376,"origWidth":2917,"width":2917,"modified":false,"extractWidth":null,"extractHeight":null,"extractLeft":0,"extractTop":0,"resizeWidth":null,"resizeHeight":null,"rotate":null,"sharpen":null},"SqueakfromaVinylSeatYumang1WebRation23.jpg":{"alt":"A wall soft sculpture tie dyed in hues of yellow, dark green, and light red with filet lace and netting elements framed in bamboo that are tied using square lashing knots. Within the filet lace is an embedded gay pornographic image using a sublimation dye technique. Two soft sculptural balls are hanging from to the wall sculpture.","origHeight":4170,"height":4170,"origWidth":2780,"width":2780,"modified":false},"OneLongPauseYumang.jpg":{"alt":"A wall soft sculpture tie-dyed in hues of blues with filet lace elements framed in bamboo that are tied using square lashing knots. Within the filet lace is an embedded gay pornographic image using a sublimation dye technique. ","origHeight":4373,"height":4373,"origWidth":2916,"width":2916,"modified":false},"Sun-KissedandWaitingYumang.jpg":{"alt":"A free standing soft sculpture tie dyed in hues of orange with filet lace and netting elements framed in bamboo that are tied using square lashing knots. Within the filet lace banner is an embedded gay pornographic image using a sublimation dye technique. There is also a cylindrical netting and soft sculptural elements shaped like a luffa gourd.","origHeight":4608,"height":4608,"origWidth":3072,"width":3072,"modified":false},"SuperstarYumang.jpg":{"alt":"A free standing soft sculpture tie dyed in hues of dark red and dark navy blue with filet lace and netting elements framed in bamboo that are tied using square lashing knots. Within the filet lace is an embedded gay pornographic image using a sublimation dye technique. The soft sculpture element has a main body suspended in the middle of the bamboo frame with tentacles wrapping around the structure.","origHeight":4608,"height":4608,"origWidth":3072,"width":3072,"modified":false},"LostinArmpitMuskYumang1WebRatio23.jpg":{"alt":"Wall sculpture in pink and purple. The top part is a soft sculpture shaped into several long pink tongues jumbled together. The bottom part is a rectangular filet lace with a detailed embroidered image in the middle that has been dye sublimated and then embellished with dimensional pointed stitches.","origHeight":4166,"height":4166,"origWidth":2778,"width":2778,"modified":false},"SlipandFallintoYouYumang3.jpg":{"alt":"A wall soft sculpture tie dyed in hues of yellow with filet lace and netting elements framed in bamboo that are tied using square lashing knots. Within the filet lace is an embedded gay pornographic image using a sublimation dye technique. Two soft sculptural bananas are attached to the wall sculpture with strings and lies on the floor.","origHeight":4608,"height":4608,"origWidth":3072,"width":3072,"modified":false},"SoftNapeHairYumangWebRatio3.jpg":{"alt":"A wall soft sculpture tie dyed in hues of pink with filet lace and netting elements framed in bamboo that are tied using square lashing knots. Within the filet lace is an embedded gay pornographic image using a sublimation dye technique.","origHeight":3805,"height":3805,"origWidth":2537,"width":2537,"modified":false},"RipeningYumang.jpg":{"alt":"A wall art sculpture with filet lace components framed with soft sculpture cording and mangoes. The color of the sculpture is a mix of yellow and green. Within the filet lace is an embedded gay pornographic image using a sublimation dye technique.","origHeight":4167,"height":4167,"origWidth":2778,"width":2778,"modified":false},"BetweentheThumbandForefingerandthenTwistingitAroundRoughlyYumang2.jpg":{"alt":"A free standing soft sculpture tie dyed in hues of purple, violet, orange, and yellow with filet lace and netting elements framed in bamboo. Within the filet lace is an embedded gay pornographic image using a sublimation dye technique. The soft sculpture element has a main body suspended in the middle of the bamboo frame with holes where a vine-like pieces are twisted around.","origHeight":4220,"height":4220,"origWidth":2813,"width":2813,"modified":false},"Non-VerbalFlirtationsYumang.jpg":{"alt":"A wall soft sculpture tie dyed in black and pink with filet lace and netting elements framed in bamboo that are tied using square lashing knots. Within the filet lace is an embedded gay pornographic image using a sublimation dye technique.","origHeight":4608,"height":4608,"origWidth":3072,"width":3072,"modified":false},"SweatDrippingAllOverYumang.jpg":{"alt":"A wall soft sculpture tie dyed in hues of violet, blue, and yellow with filet lace and netting elements framed in bamboo that are tied using square lashing knots. Within the filet lace is an embedded gay pornographic image using a sublimation dye technique.","origHeight":4367,"height":4367,"origWidth":2911,"width":2911,"modified":false}}
